ИС_СПОРТ_2022/src/Documents/РезультатыСдачиКонтрольноПереводныхНормативов/РезультатыСдачиКонтрольноПереводныхНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатыСдачиКонтрольноПереводныхНормативов</name>
  <basedOn>Document.СоревнованиеОФПСдачаНормативов</basedOn>
  <registerRecords>InformationRegister.ИтоговыеРезультатыСоревнованиийОФПСдачаНормативов</registerRecords>
  <registerRecords>AccumulationRegister.РезультатыВыполненияПоказателейИНормативов</registerRecords>
  <registerRecords>InformationRegister.РезультатыСдачиКонтрольноПереводныхНормативов</registerRecords>
  <registerRecords>InformationRegister.РезультатыПараметровСоревнованиийОФПСдачаНормативов</registerRecords>
  <registerRecords>AccumulationRegister.ИтоговыеРезультатыСдачиКонтрольноПереводныхНормативов</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Тренеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПереводаНаЭтап</name>
    <type>
      <types>DocumentRef.ПереводСпортсменовНаЭтап</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставСпортсмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставУчастников</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийЭтап</name>
      <type>
        <types>CatalogRef.ЭтапыСпортивнойПодготовки</types>
      </type>
    </attributes>
    <attributes>
      <name>СледующийЭтап</name>
      <type>
        <types>CatalogRef.ЭтапыСпортивнойПодготовки</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группа</types>
      </type>
    </attributes>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатСдачиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторИтоговогоБалла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Балл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Нормативы</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторСтрокиНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИтоговыеБаллыСпортсмена</name>
    <attributes>
      <name>УникальныйИдентификаторИтоговогоБалла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Балл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/РезультатыСдачиКонтрольноПереводныхНормативов/ObjectModule.bsl
// {Рарус adilas #1.0.0.2 -Исправления по SonarQube 2021.04.23
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);	
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	УчетСпортсменовСервер.ЗаполнитьРеквизит(ЭтотОбъект, "Ответственный", ПараметрыСеанса.ТекущийПользователь);
    
    ПараметрыОписанияКраткогоСостава = СформироватьПараметрыПостроенияСтроки();
    СтрокаОписаниКраткогоСостава = УчетСпортсменовСервер.СформироватьСтрокуПоМассиву(ПараметрыОписанияКраткогоСостава);
    
    УчетСпортсменовСервер.ЗаполнитьРеквизит(ЭтотОбъект, "КраткийСоставСпортсмены", СтрокаОписаниКраткогоСостава);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	ПроведениеСервер.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСервер.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ, "РезультатыСдачиКонтрольноПереводныхНормативов");
	ПроведениеСервер.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ, "ИтоговыеРезультатыСдачиКонтрольноПереводныхНормативов");
	
	Движения.Записать();

	ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	Движения.Записать();

	ПроведениеСервер.ВыполнитьКонтрольРезультатовОтменыПроведения(ЭтотОбъект, Отказ);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьПараметрыПостроенияСтроки()

	   ТЗСпортсменов = СоставУчастников.Выгрузить();
       ТЗСпортсменов.Свернуть("Спортсмен");
       ТЗСпортсменов.Сортировать("Спортсмен");
       
       СтруктураПараметров = Новый Структура;
       СтруктураПараметров.Вставить("МассивЗначений",ТЗСпортсменов.ВыгрузитьКолонку("Спортсмен"));
       СтруктураПараметров.Вставить("ОграниченнаяДлина",Истина);
       СтруктураПараметров.Вставить("ДлинаСтроки",1000);

       Возврат СтруктураПараметров;
       
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
